7767517
99 116
Input                    input                    0 1 input
Convolution              Conv__275                1 1 input Conv1_relu/Relu6_bn_Conv1/FusedBatchNormV3_block_5_project/Conv2D_Conv1_with_alpha/Conv2D:0 0=32 1=3 3=2 15=1 16=1 5=1 6=1152 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv__276                1 1 Conv1_relu/Relu6_bn_Conv1/FusedBatchNormV3_block_5_project/Conv2D_Conv1_with_alpha/Conv2D:0 expanded_conv_depthwise_relu/Relu6_expanded_conv_depthwise_BN/FusedBatchNormV3_expanded_conv_depthwise/depthwise_block_5_project/Conv2D:0 0=32 1=3 4=1 5=1 6=288 7=32 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv__277                1 1 expanded_conv_depthwise_relu/Relu6_expanded_conv_depthwise_BN/FusedBatchNormV3_expanded_conv_depthwise/depthwise_block_5_project/Conv2D:0 Conv__277:0 0=16 1=1 5=1 6=512
Split                    splitncnn_0              1 2 Conv__277:0 Conv__277:0_splitncnn_0 Conv__277:0_splitncnn_1
Convolution              Conv__285                1 1 Conv__277:0_splitncnn_1 block_1_expand_relu/Relu6_block_1_expand_BN/FusedBatchNormV3_block_1_depthwise_BN/FusedBatchNormV3_block_1_depthwise/depthwise_block_12_project/Conv2D_block_1_expand/Conv2D:0 0=96 1=1 5=1 6=1536 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv__288                1 1 block_1_expand_relu/Relu6_block_1_expand_BN/FusedBatchNormV3_block_1_depthwise_BN/FusedBatchNormV3_block_1_depthwise/depthwise_block_12_project/Conv2D_block_1_expand/Conv2D:0 block_1_depthwise_relu/Relu6_block_1_depthwise_BN/FusedBatchNormV3_block_1_depthwise/depthwise_block_12_project/Conv2D:0 0=96 1=3 3=2 15=1 16=1 5=1 6=864 7=96 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv__289                1 1 block_1_depthwise_relu/Relu6_block_1_depthwise_BN/FusedBatchNormV3_block_1_depthwise/depthwise_block_12_project/Conv2D:0 Conv__289:0 0=24 1=1 5=1 6=2304
Split                    splitncnn_1              1 2 Conv__289:0 Conv__289:0_splitncnn_0 Conv__289:0_splitncnn_1
Convolution              Conv__292                1 1 Conv__289:0_splitncnn_1 block_2_expand_relu/Relu6_block_2_expand_BN/FusedBatchNormV3_block_3_depthwise_BN/FusedBatchNormV3_block_3_depthwise/depthwise_block_2_expand/Conv2D:0 0=144 1=1 5=1 6=3456 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv__293                1 1 block_2_expand_relu/Relu6_block_2_expand_BN/FusedBatchNormV3_block_3_depthwise_BN/FusedBatchNormV3_block_3_depthwise/depthwise_block_2_expand/Conv2D:0 block_2_depthwise_relu/Relu6_block_2_depthwise_BN/FusedBatchNormV3_block_3_depthwise_BN/FusedBatchNormV3_block_3_depthwise/depthwise_block_2_depthwise/depthwise:0 0=144 1=3 4=1 5=1 6=1296 7=144 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv__294                1 1 block_2_depthwise_relu/Relu6_block_2_depthwise_BN/FusedBatchNormV3_block_3_depthwise_BN/FusedBatchNormV3_block_3_depthwise/depthwise_block_2_depthwise/depthwise:0 Conv__294:0 0=24 1=1 5=1 6=3456
BinaryOp                 block_2_add/add          2 1 Conv__289:0_splitncnn_0 Conv__294:0 block_2_add/add:0
Split                    splitncnn_2              1 2 block_2_add/add:0 block_2_add/add:0_splitncnn_0 block_2_add/add:0_splitncnn_1
Convolution              Conv__372                1 1 block_2_add/add:0_splitncnn_1 decoder_fpn/upblock_2/conv_bn__act_8/re_lu_8/Relu_decoder_fpn/upblock_2/conv_bn__act_8/bn/FusedBatchNormV3_Decoder/conv_bn__act_17/conv/Conv2D_decoder_fpn/upblock_2/conv_bn__act_8/conv/Conv2D:0 0=64 1=1 5=1 6=1536 9=1
Convolution              Conv__295                1 1 block_2_add/add:0_splitncnn_0 block_3_expand_relu/Relu6_block_3_expand_BN/FusedBatchNormV3_block_3_depthwise_BN/FusedBatchNormV3_block_3_depthwise/depthwise_block_3_expand/Conv2D:0 0=144 1=1 5=1 6=3456 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv__298                1 1 block_3_expand_relu/Relu6_block_3_expand_BN/FusedBatchNormV3_block_3_depthwise_BN/FusedBatchNormV3_block_3_depthwise/depthwise_block_3_expand/Conv2D:0 block_3_depthwise_relu/Relu6_block_3_depthwise_BN/FusedBatchNormV3_block_3_depthwise/depthwise:0 0=144 1=3 3=2 15=1 16=1 5=1 6=1296 7=144 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv__299                1 1 block_3_depthwise_relu/Relu6_block_3_depthwise_BN/FusedBatchNormV3_block_3_depthwise/depthwise:0 Conv__299:0 0=32 1=1 5=1 6=4608
Split                    splitncnn_3              1 2 Conv__299:0 Conv__299:0_splitncnn_0 Conv__299:0_splitncnn_1
Convolution              Conv__302                1 1 Conv__299:0_splitncnn_1 block_4_expand_relu/Relu6_block_4_expand_BN/FusedBatchNormV3_block_6_depthwise_BN/FusedBatchNormV3_block_6_depthwise/depthwise_block_4_expand/Conv2D:0 0=192 1=1 5=1 6=6144 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv__303                1 1 block_4_expand_relu/Relu6_block_4_expand_BN/FusedBatchNormV3_block_6_depthwise_BN/FusedBatchNormV3_block_6_depthwise/depthwise_block_4_expand/Conv2D:0 block_4_depthwise_relu/Relu6_block_4_depthwise_BN/FusedBatchNormV3_block_6_depthwise_BN/FusedBatchNormV3_block_6_depthwise/depthwise_block_4_depthwise/depthwise:0 0=192 1=3 4=1 5=1 6=1728 7=192 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv__304                1 1 block_4_depthwise_relu/Relu6_block_4_depthwise_BN/FusedBatchNormV3_block_6_depthwise_BN/FusedBatchNormV3_block_6_depthwise/depthwise_block_4_depthwise/depthwise:0 Conv__304:0 0=32 1=1 5=1 6=6144
BinaryOp                 block_4_add/add          2 1 Conv__299:0_splitncnn_0 Conv__304:0 block_4_add/add:0
Split                    splitncnn_4              1 2 block_4_add/add:0 block_4_add/add:0_splitncnn_0 block_4_add/add:0_splitncnn_1
Convolution              Conv__307                1 1 block_4_add/add:0_splitncnn_1 block_5_expand_relu/Relu6_block_5_expand_BN/FusedBatchNormV3_block_6_depthwise_BN/FusedBatchNormV3_block_6_depthwise/depthwise_block_5_expand/Conv2D:0 0=192 1=1 5=1 6=6144 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv__308                1 1 block_5_expand_relu/Relu6_block_5_expand_BN/FusedBatchNormV3_block_6_depthwise_BN/FusedBatchNormV3_block_6_depthwise/depthwise_block_5_expand/Conv2D:0 block_5_depthwise_relu/Relu6_block_5_depthwise_BN/FusedBatchNormV3_block_6_depthwise_BN/FusedBatchNormV3_block_6_depthwise/depthwise_block_5_depthwise/depthwise:0 0=192 1=3 4=1 5=1 6=1728 7=192 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv__309                1 1 block_5_depthwise_relu/Relu6_block_5_depthwise_BN/FusedBatchNormV3_block_6_depthwise_BN/FusedBatchNormV3_block_6_depthwise/depthwise_block_5_depthwise/depthwise:0 Conv__309:0 0=32 1=1 5=1 6=6144
BinaryOp                 block_5_add/add          2 1 block_4_add/add:0_splitncnn_0 Conv__309:0 block_5_add/add:0
Split                    splitncnn_5              1 2 block_5_add/add:0 block_5_add/add:0_splitncnn_0 block_5_add/add:0_splitncnn_1
Convolution              Conv__315                1 1 block_5_add/add:0_splitncnn_1 block_6_expand_relu/Relu6_block_6_expand_BN/FusedBatchNormV3_block_6_depthwise_BN/FusedBatchNormV3_block_6_depthwise/depthwise_block_6_expand/Conv2D:0 0=192 1=1 5=1 6=6144 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv__318                1 1 block_6_expand_relu/Relu6_block_6_expand_BN/FusedBatchNormV3_block_6_depthwise_BN/FusedBatchNormV3_block_6_depthwise/depthwise_block_6_expand/Conv2D:0 block_6_depthwise_relu/Relu6_block_6_depthwise_BN/FusedBatchNormV3_block_6_depthwise/depthwise:0 0=192 1=3 3=2 15=1 16=1 5=1 6=1728 7=192 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv__319                1 1 block_6_depthwise_relu/Relu6_block_6_depthwise_BN/FusedBatchNormV3_block_6_depthwise/depthwise:0 Conv__319:0 0=64 1=1 5=1 6=12288
Split                    splitncnn_6              1 2 Conv__319:0 Conv__319:0_splitncnn_0 Conv__319:0_splitncnn_1
Convolution              Conv__322                1 1 Conv__319:0_splitncnn_1 block_7_expand_relu/Relu6_block_7_expand_BN/FusedBatchNormV3_block_8_depthwise_BN/FusedBatchNormV3_block_8_depthwise/depthwise_block_10_depthwise/depthwise_block_7_expand/Conv2D:0 0=384 1=1 5=1 6=24576 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv__323                1 1 block_7_expand_relu/Relu6_block_7_expand_BN/FusedBatchNormV3_block_8_depthwise_BN/FusedBatchNormV3_block_8_depthwise/depthwise_block_10_depthwise/depthwise_block_7_expand/Conv2D:0 block_7_depthwise_relu/Relu6_block_7_depthwise_BN/FusedBatchNormV3_block_8_depthwise_BN/FusedBatchNormV3_block_8_depthwise/depthwise_block_10_depthwise/depthwise_block_7_depthwise/depthwise:0 0=384 1=3 4=1 5=1 6=3456 7=384 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv__324                1 1 block_7_depthwise_relu/Relu6_block_7_depthwise_BN/FusedBatchNormV3_block_8_depthwise_BN/FusedBatchNormV3_block_8_depthwise/depthwise_block_10_depthwise/depthwise_block_7_depthwise/depthwise:0 Conv__324:0 0=64 1=1 5=1 6=24576
BinaryOp                 block_7_add/add          2 1 Conv__319:0_splitncnn_0 Conv__324:0 block_7_add/add:0
Split                    splitncnn_7              1 2 block_7_add/add:0 block_7_add/add:0_splitncnn_0 block_7_add/add:0_splitncnn_1
Convolution              Conv__327                1 1 block_7_add/add:0_splitncnn_1 block_8_expand_relu/Relu6_block_8_expand_BN/FusedBatchNormV3_block_8_depthwise_BN/FusedBatchNormV3_block_8_depthwise/depthwise_block_10_depthwise/depthwise_block_8_expand/Conv2D:0 0=384 1=1 5=1 6=24576 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv__328                1 1 block_8_expand_relu/Relu6_block_8_expand_BN/FusedBatchNormV3_block_8_depthwise_BN/FusedBatchNormV3_block_8_depthwise/depthwise_block_10_depthwise/depthwise_block_8_expand/Conv2D:0 block_8_depthwise_relu/Relu6_block_8_depthwise_BN/FusedBatchNormV3_block_8_depthwise/depthwise_block_10_depthwise/depthwise:0 0=384 1=3 4=1 5=1 6=3456 7=384 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv__329                1 1 block_8_depthwise_relu/Relu6_block_8_depthwise_BN/FusedBatchNormV3_block_8_depthwise/depthwise_block_10_depthwise/depthwise:0 Conv__329:0 0=64 1=1 5=1 6=24576
BinaryOp                 block_8_add/add          2 1 block_7_add/add:0_splitncnn_0 Conv__329:0 block_8_add/add:0
Split                    splitncnn_8              1 2 block_8_add/add:0 block_8_add/add:0_splitncnn_0 block_8_add/add:0_splitncnn_1
Convolution              Conv__332                1 1 block_8_add/add:0_splitncnn_1 block_9_expand_relu/Relu6_block_9_expand_BN/FusedBatchNormV3_block_8_depthwise_BN/FusedBatchNormV3_block_8_depthwise/depthwise_block_10_depthwise/depthwise_block_9_expand/Conv2D:0 0=384 1=1 5=1 6=24576 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv__333                1 1 block_9_expand_relu/Relu6_block_9_expand_BN/FusedBatchNormV3_block_8_depthwise_BN/FusedBatchNormV3_block_8_depthwise/depthwise_block_10_depthwise/depthwise_block_9_expand/Conv2D:0 block_9_depthwise_relu/Relu6_block_9_depthwise_BN/FusedBatchNormV3_block_9_depthwise/depthwise_block_10_depthwise/depthwise:0 0=384 1=3 4=1 5=1 6=3456 7=384 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv__334                1 1 block_9_depthwise_relu/Relu6_block_9_depthwise_BN/FusedBatchNormV3_block_9_depthwise/depthwise_block_10_depthwise/depthwise:0 Conv__334:0 0=64 1=1 5=1 6=24576
BinaryOp                 block_9_add/add          2 1 block_8_add/add:0_splitncnn_0 Conv__334:0 block_9_add/add:0
Split                    splitncnn_9              1 2 block_9_add/add:0 block_9_add/add:0_splitncnn_0 block_9_add/add:0_splitncnn_1
Convolution              Conv__340                1 1 block_9_add/add:0_splitncnn_1 block_10_expand_relu/Relu6_block_10_expand_BN/FusedBatchNormV3_block_8_depthwise_BN/FusedBatchNormV3_block_8_depthwise/depthwise_block_10_depthwise/depthwise_block_10_expand/Conv2D:0 0=384 1=1 5=1 6=24576 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv__341                1 1 block_10_expand_relu/Relu6_block_10_expand_BN/FusedBatchNormV3_block_8_depthwise_BN/FusedBatchNormV3_block_8_depthwise/depthwise_block_10_depthwise/depthwise_block_10_expand/Conv2D:0 block_10_depthwise_relu/Relu6_block_10_depthwise_BN/FusedBatchNormV3_block_10_depthwise/depthwise:0 0=384 1=3 4=1 5=1 6=3456 7=384 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv__342                1 1 block_10_depthwise_relu/Relu6_block_10_depthwise_BN/FusedBatchNormV3_block_10_depthwise/depthwise:0 Conv__342:0 0=96 1=1 5=1 6=36864
Split                    splitncnn_10             1 2 Conv__342:0 Conv__342:0_splitncnn_0 Conv__342:0_splitncnn_1
Convolution              Conv__345                1 1 Conv__342:0_splitncnn_1 block_11_expand_relu/Relu6_block_11_expand_BN/FusedBatchNormV3_block_12_depthwise/depthwise_block_11_expand/Conv2D:0 0=576 1=1 5=1 6=55296 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv__346                1 1 block_11_expand_relu/Relu6_block_11_expand_BN/FusedBatchNormV3_block_12_depthwise/depthwise_block_11_expand/Conv2D:0 block_11_depthwise_relu/Relu6_block_11_depthwise_BN/FusedBatchNormV3_block_11_depthwise/depthwise_block_12_depthwise/depthwise:0 0=576 1=3 4=1 5=1 6=5184 7=576 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv__347                1 1 block_11_depthwise_relu/Relu6_block_11_depthwise_BN/FusedBatchNormV3_block_11_depthwise/depthwise_block_12_depthwise/depthwise:0 Conv__347:0 0=96 1=1 5=1 6=55296
BinaryOp                 block_11_add/add         2 1 Conv__342:0_splitncnn_0 Conv__347:0 block_11_add/add:0
Split                    splitncnn_11             1 2 block_11_add/add:0 block_11_add/add:0_splitncnn_0 block_11_add/add:0_splitncnn_1
Convolution              Conv__350                1 1 block_11_add/add:0_splitncnn_1 block_12_expand_relu/Relu6_block_12_expand_BN/FusedBatchNormV3_block_12_depthwise/depthwise_block_12_expand/Conv2D:0 0=576 1=1 5=1 6=55296 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv__351                1 1 block_12_expand_relu/Relu6_block_12_expand_BN/FusedBatchNormV3_block_12_depthwise/depthwise_block_12_expand/Conv2D:0 block_12_depthwise_relu/Relu6_block_12_depthwise_BN/FusedBatchNormV3_block_12_depthwise/depthwise:0 0=576 1=3 4=1 5=1 6=5184 7=576 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv__352                1 1 block_12_depthwise_relu/Relu6_block_12_depthwise_BN/FusedBatchNormV3_block_12_depthwise/depthwise:0 Conv__352:0 0=96 1=1 5=1 6=55296
BinaryOp                 block_12_add/add         2 1 block_11_add/add:0_splitncnn_0 Conv__352:0 block_12_add/add:0
Convolution              Conv__353                1 1 block_12_add/add:0 decoder_fpn/upblock/conv_bn__act_1/re_lu_1/Relu_decoder_fpn/upblock/conv_bn__act_1/bn/FusedBatchNormV3_Decoder/conv_bn__act_17/conv/Conv2D_decoder_fpn/upblock/conv_bn__act_1/conv/Conv2D:0 0=64 1=1 5=1 6=6144 9=1
Convolution              Conv__335                1 1 block_9_add/add:0_splitncnn_0 decoder_fpn/upblock/conv_bn__act/re_lu/Relu_decoder_fpn/upblock/conv_bn__act/bn/FusedBatchNormV3_Decoder/conv_bn__act_17/conv/Conv2D_decoder_fpn/upblock/conv_bn__act/conv/Conv2D:0 0=64 1=1 5=1 6=4096 9=1
Concat                   decoder_fpn/upblock/concat 2 1 decoder_fpn/upblock/conv_bn__act/re_lu/Relu_decoder_fpn/upblock/conv_bn__act/bn/FusedBatchNormV3_Decoder/conv_bn__act_17/conv/Conv2D_decoder_fpn/upblock/conv_bn__act/conv/Conv2D:0 decoder_fpn/upblock/conv_bn__act_1/re_lu_1/Relu_decoder_fpn/upblock/conv_bn__act_1/bn/FusedBatchNormV3_Decoder/conv_bn__act_17/conv/Conv2D_decoder_fpn/upblock/conv_bn__act_1/conv/Conv2D:0 decoder_fpn/upblock/concat:0
Split                    splitncnn_12             1 2 decoder_fpn/upblock/concat:0 decoder_fpn/upblock/concat:0_splitncnn_0 decoder_fpn/upblock/concat:0_splitncnn_1
Convolution              Conv__354                1 1 decoder_fpn/upblock/concat:0_splitncnn_1 decoder_fpn/upblock/conv_bn__act_2/re_lu_2/Relu_decoder_fpn/upblock/conv_bn__act_2/bn/FusedBatchNormV3_decoder_fpn/upblock_3/conv_bn__act_14/conv/Conv2D_decoder_fpn/upblock/conv_bn__act_2/conv/Conv2D:0 0=128 1=3 4=1 5=1 6=147456 9=1
BinaryOp                 decoder_fpn/upblock/add  2 1 decoder_fpn/upblock/conv_bn__act_2/re_lu_2/Relu_decoder_fpn/upblock/conv_bn__act_2/bn/FusedBatchNormV3_decoder_fpn/upblock_3/conv_bn__act_14/conv/Conv2D_decoder_fpn/upblock/conv_bn__act_2/conv/Conv2D:0 decoder_fpn/upblock/concat:0_splitncnn_0 decoder_fpn/upblock/add:0
Convolution              Conv__355                1 1 decoder_fpn/upblock/add:0 decoder_fpn/upblock/re_lu_3/Relu_decoder_fpn/upblock/conv_bn__act_3/bn/FusedBatchNormV3_Decoder/conv_bn__act_17/conv/Conv2D_decoder_fpn/upblock/conv_bn__act_3/conv/Conv2D:0 0=64 1=3 4=1 5=1 6=73728 9=1
Interp                   Resize__212              1 1 decoder_fpn/upblock/re_lu_3/Relu_decoder_fpn/upblock/conv_bn__act_3/bn/FusedBatchNormV3_Decoder/conv_bn__act_17/conv/Conv2D_decoder_fpn/upblock/conv_bn__act_3/conv/Conv2D:0 Resize__212:0 0=2 3=40 4=40
Convolution              Conv__356                1 1 Resize__212:0 decoder_fpn/upblock_1/conv_bn__act_5/re_lu_5/Relu_decoder_fpn/upblock_1/conv_bn__act_5/bn/FusedBatchNormV3_Decoder/conv_bn__act_17/conv/Conv2D_decoder_fpn/upblock_1/conv_bn__act_5/conv/Conv2D:0 0=64 1=1 5=1 6=4096 9=1
Convolution              Conv__310                1 1 block_5_add/add:0_splitncnn_0 decoder_fpn/upblock_1/conv_bn__act_4/re_lu_4/Relu_decoder_fpn/upblock_1/conv_bn__act_4/bn/FusedBatchNormV3_Decoder/conv_bn__act_17/conv/Conv2D_decoder_fpn/upblock_1/conv_bn__act_4/conv/Conv2D:0 0=64 1=1 5=1 6=2048 9=1
Concat                   decoder_fpn/upblock_1/concat 2 1 decoder_fpn/upblock_1/conv_bn__act_4/re_lu_4/Relu_decoder_fpn/upblock_1/conv_bn__act_4/bn/FusedBatchNormV3_Decoder/conv_bn__act_17/conv/Conv2D_decoder_fpn/upblock_1/conv_bn__act_4/conv/Conv2D:0 decoder_fpn/upblock_1/conv_bn__act_5/re_lu_5/Relu_decoder_fpn/upblock_1/conv_bn__act_5/bn/FusedBatchNormV3_Decoder/conv_bn__act_17/conv/Conv2D_decoder_fpn/upblock_1/conv_bn__act_5/conv/Conv2D:0 decoder_fpn/upblock_1/concat:0
Split                    splitncnn_13             1 2 decoder_fpn/upblock_1/concat:0 decoder_fpn/upblock_1/concat:0_splitncnn_0 decoder_fpn/upblock_1/concat:0_splitncnn_1
Convolution              Conv__361                1 1 decoder_fpn/upblock_1/concat:0_splitncnn_1 decoder_fpn/upblock_1/conv_bn__act_6/re_lu_6/Relu_decoder_fpn/upblock_1/conv_bn__act_6/bn/FusedBatchNormV3_decoder_fpn/upblock_3/conv_bn__act_14/conv/Conv2D_decoder_fpn/upblock_1/conv_bn__act_6/conv/Conv2D:0 0=128 1=3 4=1 5=1 6=147456 9=1
BinaryOp                 decoder_fpn/upblock_1/add 2 1 decoder_fpn/upblock_1/conv_bn__act_6/re_lu_6/Relu_decoder_fpn/upblock_1/conv_bn__act_6/bn/FusedBatchNormV3_decoder_fpn/upblock_3/conv_bn__act_14/conv/Conv2D_decoder_fpn/upblock_1/conv_bn__act_6/conv/Conv2D:0 decoder_fpn/upblock_1/concat:0_splitncnn_0 decoder_fpn/upblock_1/add:0
Convolution              Conv__362                1 1 decoder_fpn/upblock_1/add:0 decoder_fpn/upblock_1/re_lu_7/Relu_decoder_fpn/upblock_1/conv_bn__act_7/bn/FusedBatchNormV3_Decoder/conv_bn__act_17/conv/Conv2D_decoder_fpn/upblock_1/conv_bn__act_7/conv/Conv2D:0 0=64 1=3 4=1 5=1 6=73728 9=1
Interp                   Resize__228              1 1 decoder_fpn/upblock_1/re_lu_7/Relu_decoder_fpn/upblock_1/conv_bn__act_7/bn/FusedBatchNormV3_Decoder/conv_bn__act_17/conv/Conv2D_decoder_fpn/upblock_1/conv_bn__act_7/conv/Conv2D:0 Resize__228:0 0=2 3=80 4=80
Convolution              Conv__363                1 1 Resize__228:0 decoder_fpn/upblock_2/conv_bn__act_9/re_lu_9/Relu_decoder_fpn/upblock_2/conv_bn__act_9/bn/FusedBatchNormV3_Decoder/conv_bn__act_17/conv/Conv2D_decoder_fpn/upblock_2/conv_bn__act_9/conv/Conv2D:0 0=64 1=1 5=1 6=4096 9=1
Concat                   decoder_fpn/upblock_2/concat 2 1 decoder_fpn/upblock_2/conv_bn__act_8/re_lu_8/Relu_decoder_fpn/upblock_2/conv_bn__act_8/bn/FusedBatchNormV3_Decoder/conv_bn__act_17/conv/Conv2D_decoder_fpn/upblock_2/conv_bn__act_8/conv/Conv2D:0 decoder_fpn/upblock_2/conv_bn__act_9/re_lu_9/Relu_decoder_fpn/upblock_2/conv_bn__act_9/bn/FusedBatchNormV3_Decoder/conv_bn__act_17/conv/Conv2D_decoder_fpn/upblock_2/conv_bn__act_9/conv/Conv2D:0 decoder_fpn/upblock_2/concat:0
Split                    splitncnn_14             1 2 decoder_fpn/upblock_2/concat:0 decoder_fpn/upblock_2/concat:0_splitncnn_0 decoder_fpn/upblock_2/concat:0_splitncnn_1
Convolution              Conv__373                1 1 decoder_fpn/upblock_2/concat:0_splitncnn_1 decoder_fpn/upblock_2/conv_bn__act_10/re_lu_10/Relu_decoder_fpn/upblock_2/conv_bn__act_10/bn/FusedBatchNormV3_decoder_fpn/upblock_3/conv_bn__act_14/conv/Conv2D_decoder_fpn/upblock_2/conv_bn__act_10/conv/Conv2D:0 0=128 1=3 4=1 5=1 6=147456 9=1
BinaryOp                 decoder_fpn/upblock_2/add 2 1 decoder_fpn/upblock_2/conv_bn__act_10/re_lu_10/Relu_decoder_fpn/upblock_2/conv_bn__act_10/bn/FusedBatchNormV3_decoder_fpn/upblock_3/conv_bn__act_14/conv/Conv2D_decoder_fpn/upblock_2/conv_bn__act_10/conv/Conv2D:0 decoder_fpn/upblock_2/concat:0_splitncnn_0 decoder_fpn/upblock_2/add:0
Convolution              Conv__374                1 1 decoder_fpn/upblock_2/add:0 decoder_fpn/upblock_2/re_lu_11/Relu_decoder_fpn/upblock_2/conv_bn__act_11/bn/FusedBatchNormV3_Decoder/conv_bn__act_17/conv/Conv2D_decoder_fpn/upblock_2/conv_bn__act_11/conv/Conv2D:0 0=64 1=3 4=1 5=1 6=73728 9=1
Interp                   Resize__246              1 1 decoder_fpn/upblock_2/re_lu_11/Relu_decoder_fpn/upblock_2/conv_bn__act_11/bn/FusedBatchNormV3_Decoder/conv_bn__act_17/conv/Conv2D_decoder_fpn/upblock_2/conv_bn__act_11/conv/Conv2D:0 Resize__246:0 0=2 3=160 4=160
Convolution              Conv__375                1 1 Resize__246:0 decoder_fpn/upblock_3/conv_bn__act_13/re_lu_13/Relu_decoder_fpn/upblock_3/conv_bn__act_13/bn/FusedBatchNormV3_Decoder/conv_bn__act_17/conv/Conv2D_decoder_fpn/upblock_3/conv_bn__act_13/conv/Conv2D:0 0=64 1=1 5=1 6=4096 9=1
Convolution              Conv__280                1 1 Conv__277:0_splitncnn_0 decoder_fpn/upblock_3/conv_bn__act_12/re_lu_12/Relu_decoder_fpn/upblock_3/conv_bn__act_12/bn/FusedBatchNormV3_Decoder/conv_bn__act_17/conv/Conv2D_decoder_fpn/upblock_3/conv_bn__act_12/conv/Conv2D:0 0=64 1=1 5=1 6=1024 9=1
Concat                   decoder_fpn/upblock_3/concat 2 1 decoder_fpn/upblock_3/conv_bn__act_12/re_lu_12/Relu_decoder_fpn/upblock_3/conv_bn__act_12/bn/FusedBatchNormV3_Decoder/conv_bn__act_17/conv/Conv2D_decoder_fpn/upblock_3/conv_bn__act_12/conv/Conv2D:0 decoder_fpn/upblock_3/conv_bn__act_13/re_lu_13/Relu_decoder_fpn/upblock_3/conv_bn__act_13/bn/FusedBatchNormV3_Decoder/conv_bn__act_17/conv/Conv2D_decoder_fpn/upblock_3/conv_bn__act_13/conv/Conv2D:0 decoder_fpn/upblock_3/concat:0
Split                    splitncnn_15             1 2 decoder_fpn/upblock_3/concat:0 decoder_fpn/upblock_3/concat:0_splitncnn_0 decoder_fpn/upblock_3/concat:0_splitncnn_1
Convolution              Conv__380                1 1 decoder_fpn/upblock_3/concat:0_splitncnn_1 decoder_fpn/upblock_3/conv_bn__act_14/re_lu_14/Relu_decoder_fpn/upblock_3/conv_bn__act_14/bn/FusedBatchNormV3_decoder_fpn/upblock_3/conv_bn__act_14/conv/Conv2D:0 0=128 1=3 4=1 5=1 6=147456 9=1
BinaryOp                 decoder_fpn/upblock_3/add 2 1 decoder_fpn/upblock_3/conv_bn__act_14/re_lu_14/Relu_decoder_fpn/upblock_3/conv_bn__act_14/bn/FusedBatchNormV3_decoder_fpn/upblock_3/conv_bn__act_14/conv/Conv2D:0 decoder_fpn/upblock_3/concat:0_splitncnn_0 decoder_fpn/upblock_3/add:0
Convolution              Conv__381                1 1 decoder_fpn/upblock_3/add:0 decoder_fpn/upblock_3/re_lu_15/Relu_decoder_fpn/upblock_3/conv_bn__act_15/bn/FusedBatchNormV3_Decoder/conv_bn__act_17/conv/Conv2D_decoder_fpn/upblock_3/conv_bn__act_15/conv/Conv2D:0 0=64 1=3 4=1 5=1 6=73728 9=1
Convolution              Conv__382                1 1 decoder_fpn/upblock_3/re_lu_15/Relu_decoder_fpn/upblock_3/conv_bn__act_15/bn/FusedBatchNormV3_Decoder/conv_bn__act_17/conv/Conv2D_decoder_fpn/upblock_3/conv_bn__act_15/conv/Conv2D:0 Decoder/conv_bn__act_16/re_lu_16/Relu_Decoder/conv_bn__act_16/bn/FusedBatchNormV3_Decoder/conv_bn__act_17/conv/Conv2D_Decoder/conv_bn__act_16/conv/Conv2D:0 0=64 1=3 2=5 4=5 5=1 6=36864 9=1
Convolution              Conv__383                1 1 Decoder/conv_bn__act_16/re_lu_16/Relu_Decoder/conv_bn__act_16/bn/FusedBatchNormV3_Decoder/conv_bn__act_17/conv/Conv2D_Decoder/conv_bn__act_16/conv/Conv2D:0 Decoder/conv_bn__act_17/re_lu_17/Relu_Decoder/conv_bn__act_17/bn/FusedBatchNormV3_Decoder/conv_bn__act_17/conv/Conv2D:0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution              Conv__384                1 1 Decoder/conv_bn__act_17/re_lu_17/Relu_Decoder/conv_bn__act_17/bn/FusedBatchNormV3_Decoder/conv_bn__act_17/conv/Conv2D:0 Conv__384:0 0=16 1=1 5=1 6=1024
Split                    splitncnn_16             1 2 Conv__384:0 Conv__384:0_splitncnn_0 Conv__384:0_splitncnn_1
Crop                     Crop_0                   1 1 Conv__384:0_splitncnn_1 out1 -23309=3,0,0,8 -23310=3,2147483647,2147483647,12 -23311=3,1,2,0
Crop                     Decoder/strided_slice_41 1 1 Conv__384:0_splitncnn_0 Decoder/strided_slice_41:0 -23309=3,0,0,7 -23310=3,2147483647,2147483647,8 -23311=3,1,2,0
Sigmoid                  Decoder/Sigmoid_4        1 1 Decoder/strided_slice_41:0 Decoder/Sigmoid_4:0
Pooling                  Decoder/max_pooling2d/MaxPool 1 1 Decoder/Sigmoid_4:0 out2 1=3 3=1 5=1
