7767517
70 81
Input                    input                    0 1 input
Convolution              Conv__220                1 1 input Conv1_relu/Relu6_bn_Conv1/FusedBatchNormV3_decoder_fpn/upblock_1/conv_bn__act_4/conv/Conv2D_Conv1_with_alpha/Conv2D:0 0=32 1=3 3=2 15=1 16=1 5=1 6=1152 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv__221                1 1 Conv1_relu/Relu6_bn_Conv1/FusedBatchNormV3_decoder_fpn/upblock_1/conv_bn__act_4/conv/Conv2D_Conv1_with_alpha/Conv2D:0 expanded_conv_depthwise_relu/Relu6_expanded_conv_depthwise_BN/FusedBatchNormV3_expanded_conv_depthwise/depthwise_decoder_fpn/upblock_1/conv_bn__act_4/conv/Conv2D:0 0=32 1=3 4=1 5=1 6=288 7=32 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv__222                1 1 expanded_conv_depthwise_relu/Relu6_expanded_conv_depthwise_BN/FusedBatchNormV3_expanded_conv_depthwise/depthwise_decoder_fpn/upblock_1/conv_bn__act_4/conv/Conv2D:0 Conv__222:0 0=16 1=1 5=1 6=512
Convolution              Conv__223                1 1 Conv__222:0 block_1_expand_relu/Relu6_block_1_expand_BN/FusedBatchNormV3_block_1_depthwise_BN/FusedBatchNormV3_block_1_depthwise/depthwise_block_1_expand/Conv2D:0 0=96 1=1 5=1 6=1536 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv__226                1 1 block_1_expand_relu/Relu6_block_1_expand_BN/FusedBatchNormV3_block_1_depthwise_BN/FusedBatchNormV3_block_1_depthwise/depthwise_block_1_expand/Conv2D:0 block_1_depthwise_relu/Relu6_block_1_depthwise_BN/FusedBatchNormV3_block_1_depthwise/depthwise:0 0=96 1=3 3=2 15=1 16=1 5=1 6=864 7=96 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv__227                1 1 block_1_depthwise_relu/Relu6_block_1_depthwise_BN/FusedBatchNormV3_block_1_depthwise/depthwise:0 Conv__227:0 0=24 1=1 5=1 6=2304
Split                    splitncnn_0              1 2 Conv__227:0 Conv__227:0_splitncnn_0 Conv__227:0_splitncnn_1
Convolution              Conv__230                1 1 Conv__227:0_splitncnn_1 block_2_expand_relu/Relu6_block_2_expand_BN/FusedBatchNormV3_block_3_depthwise_BN/FusedBatchNormV3_block_3_depthwise/depthwise_block_2_expand/Conv2D:0 0=144 1=1 5=1 6=3456 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv__231                1 1 block_2_expand_relu/Relu6_block_2_expand_BN/FusedBatchNormV3_block_3_depthwise_BN/FusedBatchNormV3_block_3_depthwise/depthwise_block_2_expand/Conv2D:0 block_2_depthwise_relu/Relu6_block_2_depthwise_BN/FusedBatchNormV3_block_3_depthwise_BN/FusedBatchNormV3_block_3_depthwise/depthwise_block_2_depthwise/depthwise:0 0=144 1=3 4=1 5=1 6=1296 7=144 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv__232                1 1 block_2_depthwise_relu/Relu6_block_2_depthwise_BN/FusedBatchNormV3_block_3_depthwise_BN/FusedBatchNormV3_block_3_depthwise/depthwise_block_2_depthwise/depthwise:0 Conv__232:0 0=24 1=1 5=1 6=3456
BinaryOp                 block_2_add/add          2 1 Conv__227:0_splitncnn_0 Conv__232:0 block_2_add/add:0
Split                    splitncnn_1              1 2 block_2_add/add:0 block_2_add/add:0_splitncnn_0 block_2_add/add:0_splitncnn_1
Convolution              Conv__289                1 1 block_2_add/add:0_splitncnn_1 decoder_fpn/upblock_1/conv_bn__act_4/re_lu_4/Relu_decoder_fpn/upblock_1/conv_bn__act_4/bn/FusedBatchNormV3_decoder_fpn/upblock_1/conv_bn__act_4/conv/Conv2D:0 0=32 1=1 5=1 6=768 9=1
Convolution              Conv__233                1 1 block_2_add/add:0_splitncnn_0 block_3_expand_relu/Relu6_block_3_expand_BN/FusedBatchNormV3_block_3_depthwise_BN/FusedBatchNormV3_block_3_depthwise/depthwise_block_3_expand/Conv2D:0 0=144 1=1 5=1 6=3456 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv__236                1 1 block_3_expand_relu/Relu6_block_3_expand_BN/FusedBatchNormV3_block_3_depthwise_BN/FusedBatchNormV3_block_3_depthwise/depthwise_block_3_expand/Conv2D:0 block_3_depthwise_relu/Relu6_block_3_depthwise_BN/FusedBatchNormV3_block_3_depthwise/depthwise:0 0=144 1=3 3=2 15=1 16=1 5=1 6=1296 7=144 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv__237                1 1 block_3_depthwise_relu/Relu6_block_3_depthwise_BN/FusedBatchNormV3_block_3_depthwise/depthwise:0 Conv__237:0 0=32 1=1 5=1 6=4608
Split                    splitncnn_2              1 2 Conv__237:0 Conv__237:0_splitncnn_0 Conv__237:0_splitncnn_1
Convolution              Conv__240                1 1 Conv__237:0_splitncnn_1 block_4_expand_relu/Relu6_block_4_expand_BN/FusedBatchNormV3_block_6_depthwise_BN/FusedBatchNormV3_block_6_depthwise/depthwise_block_4_expand/Conv2D:0 0=192 1=1 5=1 6=6144 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv__241                1 1 block_4_expand_relu/Relu6_block_4_expand_BN/FusedBatchNormV3_block_6_depthwise_BN/FusedBatchNormV3_block_6_depthwise/depthwise_block_4_expand/Conv2D:0 block_4_depthwise_relu/Relu6_block_4_depthwise_BN/FusedBatchNormV3_block_6_depthwise_BN/FusedBatchNormV3_block_6_depthwise/depthwise_block_4_depthwise/depthwise:0 0=192 1=3 4=1 5=1 6=1728 7=192 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv__242                1 1 block_4_depthwise_relu/Relu6_block_4_depthwise_BN/FusedBatchNormV3_block_6_depthwise_BN/FusedBatchNormV3_block_6_depthwise/depthwise_block_4_depthwise/depthwise:0 Conv__242:0 0=32 1=1 5=1 6=6144
BinaryOp                 block_4_add/add          2 1 Conv__237:0_splitncnn_0 Conv__242:0 block_4_add/add:0
Split                    splitncnn_3              1 2 block_4_add/add:0 block_4_add/add:0_splitncnn_0 block_4_add/add:0_splitncnn_1
Convolution              Conv__245                1 1 block_4_add/add:0_splitncnn_1 block_5_expand_relu/Relu6_block_5_expand_BN/FusedBatchNormV3_block_6_depthwise_BN/FusedBatchNormV3_block_6_depthwise/depthwise_block_5_expand/Conv2D:0 0=192 1=1 5=1 6=6144 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv__246                1 1 block_5_expand_relu/Relu6_block_5_expand_BN/FusedBatchNormV3_block_6_depthwise_BN/FusedBatchNormV3_block_6_depthwise/depthwise_block_5_expand/Conv2D:0 block_5_depthwise_relu/Relu6_block_5_depthwise_BN/FusedBatchNormV3_block_6_depthwise_BN/FusedBatchNormV3_block_6_depthwise/depthwise_block_5_depthwise/depthwise:0 0=192 1=3 4=1 5=1 6=1728 7=192 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv__247                1 1 block_5_depthwise_relu/Relu6_block_5_depthwise_BN/FusedBatchNormV3_block_6_depthwise_BN/FusedBatchNormV3_block_6_depthwise/depthwise_block_5_depthwise/depthwise:0 Conv__247:0 0=32 1=1 5=1 6=6144
BinaryOp                 block_5_add/add          2 1 block_4_add/add:0_splitncnn_0 Conv__247:0 block_5_add/add:0
Split                    splitncnn_4              1 2 block_5_add/add:0 block_5_add/add:0_splitncnn_0 block_5_add/add:0_splitncnn_1
Convolution              Conv__253                1 1 block_5_add/add:0_splitncnn_1 block_6_expand_relu/Relu6_block_6_expand_BN/FusedBatchNormV3_block_6_depthwise_BN/FusedBatchNormV3_block_6_depthwise/depthwise_block_6_expand/Conv2D:0 0=192 1=1 5=1 6=6144 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv__256                1 1 block_6_expand_relu/Relu6_block_6_expand_BN/FusedBatchNormV3_block_6_depthwise_BN/FusedBatchNormV3_block_6_depthwise/depthwise_block_6_expand/Conv2D:0 block_6_depthwise_relu/Relu6_block_6_depthwise_BN/FusedBatchNormV3_block_6_depthwise/depthwise:0 0=192 1=3 3=2 15=1 16=1 5=1 6=1728 7=192 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv__257                1 1 block_6_depthwise_relu/Relu6_block_6_depthwise_BN/FusedBatchNormV3_block_6_depthwise/depthwise:0 Conv__257:0 0=64 1=1 5=1 6=12288
Split                    splitncnn_5              1 2 Conv__257:0 Conv__257:0_splitncnn_0 Conv__257:0_splitncnn_1
Convolution              Conv__260                1 1 Conv__257:0_splitncnn_1 block_7_expand_relu/Relu6_block_7_expand_BN/FusedBatchNormV3_block_8_depthwise_BN/FusedBatchNormV3_block_8_depthwise/depthwise_block_9_depthwise/depthwise_block_7_expand/Conv2D:0 0=384 1=1 5=1 6=24576 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv__261                1 1 block_7_expand_relu/Relu6_block_7_expand_BN/FusedBatchNormV3_block_8_depthwise_BN/FusedBatchNormV3_block_8_depthwise/depthwise_block_9_depthwise/depthwise_block_7_expand/Conv2D:0 block_7_depthwise_relu/Relu6_block_7_depthwise_BN/FusedBatchNormV3_block_8_depthwise_BN/FusedBatchNormV3_block_8_depthwise/depthwise_block_9_depthwise/depthwise_block_7_depthwise/depthwise:0 0=384 1=3 4=1 5=1 6=3456 7=384 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv__262                1 1 block_7_depthwise_relu/Relu6_block_7_depthwise_BN/FusedBatchNormV3_block_8_depthwise_BN/FusedBatchNormV3_block_8_depthwise/depthwise_block_9_depthwise/depthwise_block_7_depthwise/depthwise:0 Conv__262:0 0=64 1=1 5=1 6=24576
BinaryOp                 block_7_add/add          2 1 Conv__257:0_splitncnn_0 Conv__262:0 block_7_add/add:0
Split                    splitncnn_6              1 2 block_7_add/add:0 block_7_add/add:0_splitncnn_0 block_7_add/add:0_splitncnn_1
Convolution              Conv__265                1 1 block_7_add/add:0_splitncnn_1 block_8_expand_relu/Relu6_block_8_expand_BN/FusedBatchNormV3_block_8_depthwise_BN/FusedBatchNormV3_block_8_depthwise/depthwise_block_9_depthwise/depthwise_block_8_expand/Conv2D:0 0=384 1=1 5=1 6=24576 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv__266                1 1 block_8_expand_relu/Relu6_block_8_expand_BN/FusedBatchNormV3_block_8_depthwise_BN/FusedBatchNormV3_block_8_depthwise/depthwise_block_9_depthwise/depthwise_block_8_expand/Conv2D:0 block_8_depthwise_relu/Relu6_block_8_depthwise_BN/FusedBatchNormV3_block_8_depthwise/depthwise_block_9_depthwise/depthwise:0 0=384 1=3 4=1 5=1 6=3456 7=384 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv__267                1 1 block_8_depthwise_relu/Relu6_block_8_depthwise_BN/FusedBatchNormV3_block_8_depthwise/depthwise_block_9_depthwise/depthwise:0 Conv__267:0 0=64 1=1 5=1 6=24576
BinaryOp                 block_8_add/add          2 1 block_7_add/add:0_splitncnn_0 Conv__267:0 block_8_add/add:0
Split                    splitncnn_7              1 2 block_8_add/add:0 block_8_add/add:0_splitncnn_0 block_8_add/add:0_splitncnn_1
Convolution              Conv__270                1 1 block_8_add/add:0_splitncnn_1 block_9_expand_relu/Relu6_block_9_expand_BN/FusedBatchNormV3_block_8_depthwise_BN/FusedBatchNormV3_block_8_depthwise/depthwise_block_9_depthwise/depthwise_block_9_expand/Conv2D:0 0=384 1=1 5=1 6=24576 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv__271                1 1 block_9_expand_relu/Relu6_block_9_expand_BN/FusedBatchNormV3_block_8_depthwise_BN/FusedBatchNormV3_block_8_depthwise/depthwise_block_9_depthwise/depthwise_block_9_expand/Conv2D:0 block_9_depthwise_relu/Relu6_block_9_depthwise_BN/FusedBatchNormV3_block_9_depthwise/depthwise:0 0=384 1=3 4=1 5=1 6=3456 7=384 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv__272                1 1 block_9_depthwise_relu/Relu6_block_9_depthwise_BN/FusedBatchNormV3_block_9_depthwise/depthwise:0 Conv__272:0 0=64 1=1 5=1 6=24576
BinaryOp                 block_9_add/add          2 1 block_8_add/add:0_splitncnn_0 Conv__272:0 block_9_add/add:0
Interp                   Resize__163              1 1 block_9_add/add:0 Resize__163:0 0=2 3=40 4=40
Convolution              Conv__273                1 1 Resize__163:0 decoder_fpn/upblock/conv_bn__act_1/re_lu_1/Relu_decoder_fpn/upblock/conv_bn__act_1/bn/FusedBatchNormV3_Decoder/conv_bn__act_9/conv/Conv2D_decoder_fpn/upblock/conv_bn__act_1/conv/Conv2D:0 0=64 1=1 5=1 6=4096 9=1
Convolution              Conv__248                1 1 block_5_add/add:0_splitncnn_0 decoder_fpn/upblock/conv_bn__act/re_lu/Relu_decoder_fpn/upblock/conv_bn__act/bn/FusedBatchNormV3_Decoder/conv_bn__act_9/conv/Conv2D_decoder_fpn/upblock/conv_bn__act/conv/Conv2D:0 0=64 1=1 5=1 6=2048 9=1
Concat                   decoder_fpn/upblock/concat 2 1 decoder_fpn/upblock/conv_bn__act/re_lu/Relu_decoder_fpn/upblock/conv_bn__act/bn/FusedBatchNormV3_Decoder/conv_bn__act_9/conv/Conv2D_decoder_fpn/upblock/conv_bn__act/conv/Conv2D:0 decoder_fpn/upblock/conv_bn__act_1/re_lu_1/Relu_decoder_fpn/upblock/conv_bn__act_1/bn/FusedBatchNormV3_Decoder/conv_bn__act_9/conv/Conv2D_decoder_fpn/upblock/conv_bn__act_1/conv/Conv2D:0 decoder_fpn/upblock/concat:0
Split                    splitncnn_8              1 2 decoder_fpn/upblock/concat:0 decoder_fpn/upblock/concat:0_splitncnn_0 decoder_fpn/upblock/concat:0_splitncnn_1
Convolution              Conv__278                1 1 decoder_fpn/upblock/concat:0_splitncnn_1 decoder_fpn/upblock/conv_bn__act_2/re_lu_2/Relu_decoder_fpn/upblock/conv_bn__act_2/bn/FusedBatchNormV3_decoder_fpn/upblock/conv_bn__act_2/conv/Conv2D:0 0=128 1=3 4=1 5=1 6=147456 9=1
BinaryOp                 decoder_fpn/upblock/add  2 1 decoder_fpn/upblock/conv_bn__act_2/re_lu_2/Relu_decoder_fpn/upblock/conv_bn__act_2/bn/FusedBatchNormV3_decoder_fpn/upblock/conv_bn__act_2/conv/Conv2D:0 decoder_fpn/upblock/concat:0_splitncnn_0 decoder_fpn/upblock/add:0
Convolution              Conv__279                1 1 decoder_fpn/upblock/add:0 decoder_fpn/upblock/re_lu_3/Relu_decoder_fpn/upblock/conv_bn__act_3/bn/FusedBatchNormV3_Decoder/conv_bn__act_9/conv/Conv2D_decoder_fpn/upblock/conv_bn__act_3/conv/Conv2D:0 0=64 1=3 4=1 5=1 6=73728 9=1
Interp                   Resize__179              1 1 decoder_fpn/upblock/re_lu_3/Relu_decoder_fpn/upblock/conv_bn__act_3/bn/FusedBatchNormV3_Decoder/conv_bn__act_9/conv/Conv2D_decoder_fpn/upblock/conv_bn__act_3/conv/Conv2D:0 Resize__179:0 0=2 3=80 4=80
Convolution              Conv__280                1 1 Resize__179:0 decoder_fpn/upblock_1/conv_bn__act_5/re_lu_5/Relu_decoder_fpn/upblock_1/conv_bn__act_5/bn/FusedBatchNormV3_decoder_fpn/upblock_1/conv_bn__act_4/conv/Conv2D_decoder_fpn/upblock_1/conv_bn__act_5/conv/Conv2D:0 0=32 1=1 5=1 6=2048 9=1
Concat                   decoder_fpn/upblock_1/concat 2 1 decoder_fpn/upblock_1/conv_bn__act_4/re_lu_4/Relu_decoder_fpn/upblock_1/conv_bn__act_4/bn/FusedBatchNormV3_decoder_fpn/upblock_1/conv_bn__act_4/conv/Conv2D:0 decoder_fpn/upblock_1/conv_bn__act_5/re_lu_5/Relu_decoder_fpn/upblock_1/conv_bn__act_5/bn/FusedBatchNormV3_decoder_fpn/upblock_1/conv_bn__act_4/conv/Conv2D_decoder_fpn/upblock_1/conv_bn__act_5/conv/Conv2D:0 decoder_fpn/upblock_1/concat:0
Split                    splitncnn_9              1 2 decoder_fpn/upblock_1/concat:0 decoder_fpn/upblock_1/concat:0_splitncnn_0 decoder_fpn/upblock_1/concat:0_splitncnn_1
Convolution              Conv__290                1 1 decoder_fpn/upblock_1/concat:0_splitncnn_1 decoder_fpn/upblock_1/conv_bn__act_6/re_lu_6/Relu_decoder_fpn/upblock_1/conv_bn__act_6/bn/FusedBatchNormV3_Decoder/conv_bn__act_9/conv/Conv2D_decoder_fpn/upblock_1/conv_bn__act_6/conv/Conv2D:0 0=64 1=3 4=1 5=1 6=36864 9=1
BinaryOp                 decoder_fpn/upblock_1/add 2 1 decoder_fpn/upblock_1/conv_bn__act_6/re_lu_6/Relu_decoder_fpn/upblock_1/conv_bn__act_6/bn/FusedBatchNormV3_Decoder/conv_bn__act_9/conv/Conv2D_decoder_fpn/upblock_1/conv_bn__act_6/conv/Conv2D:0 decoder_fpn/upblock_1/concat:0_splitncnn_0 decoder_fpn/upblock_1/add:0
Convolution              Conv__291                1 1 decoder_fpn/upblock_1/add:0 decoder_fpn/upblock_1/re_lu_7/Relu_decoder_fpn/upblock_1/conv_bn__act_7/bn/FusedBatchNormV3_Decoder/conv_bn__act_9/conv/Conv2D_decoder_fpn/upblock_1/conv_bn__act_7/conv/Conv2D:0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution              Conv__292                1 1 decoder_fpn/upblock_1/re_lu_7/Relu_decoder_fpn/upblock_1/conv_bn__act_7/bn/FusedBatchNormV3_Decoder/conv_bn__act_9/conv/Conv2D_decoder_fpn/upblock_1/conv_bn__act_7/conv/Conv2D:0 Decoder/conv_bn__act_8/re_lu_8/Relu_Decoder/conv_bn__act_8/bn/FusedBatchNormV3_Decoder/conv_bn__act_9/conv/Conv2D_Decoder/conv_bn__act_8/conv/Conv2D:0 0=64 1=3 2=5 4=5 5=1 6=36864 9=1
Convolution              Conv__293                1 1 Decoder/conv_bn__act_8/re_lu_8/Relu_Decoder/conv_bn__act_8/bn/FusedBatchNormV3_Decoder/conv_bn__act_9/conv/Conv2D_Decoder/conv_bn__act_8/conv/Conv2D:0 Decoder/conv_bn__act_9/re_lu_9/Relu_Decoder/conv_bn__act_9/bn/FusedBatchNormV3_Decoder/conv_bn__act_9/conv/Conv2D:0 0=64 1=3 4=1 5=1 6=36864 9=1
Convolution              Conv__294                1 1 Decoder/conv_bn__act_9/re_lu_9/Relu_Decoder/conv_bn__act_9/bn/FusedBatchNormV3_Decoder/conv_bn__act_9/conv/Conv2D:0 Conv__294:0 0=16 1=1 5=1 6=1024
Interp                   Resize__203              1 1 Conv__294:0 Resize__203:0 0=2 3=160 4=160
Split                    splitncnn_10             1 2 Resize__203:0 Resize__203:0_splitncnn_0 Resize__203:0_splitncnn_1
Crop                     Crop_0                   1 1 Resize__203:0_splitncnn_1 out1 -23309=3,0,0,8 -23310=3,2147483647,2147483647,12 -23311=3,1,2,0
Crop                     Decoder/strided_slice_41 1 1 Resize__203:0_splitncnn_0 Decoder/strided_slice_41:0 -23309=3,0,0,7 -23310=3,2147483647,2147483647,8 -23311=3,1,2,0
Sigmoid                  Decoder/Sigmoid_4        1 1 Decoder/strided_slice_41:0 Decoder/Sigmoid_4:0
Pooling                  Decoder/max_pooling2d/MaxPool 1 1 Decoder/Sigmoid_4:0 out2 1=3 3=1 5=1
